Core/src/InformationRegisters/НормыВремениРабот/НормыВремениРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыВремениРабот</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
</mdclass:Enum>

Core/src/InformationRegisters/НормыВремениРабот/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		Номенклатура = Параметры.Отбор.Номенклатура;
		
		Если Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Работа Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ka='დროის ნორმები ინახება მხოლოდ სამუშაოებისთვის';ru='Нормы времени хранятся только для работ'");
			
			Элементы.Список.ТолькоПросмотр = Истина;
			
		ИначеЕсли Номенклатура.ФиксированнаяСтоимость Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ka='""სამუშაოების ღირებულების გამოთვლის მეთოდი"" უნდა იყოს ""დროის ნორმა""';ru='""Способ расчета стоимости работ"" должен быть ""Норма времени""'");
			
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры // ПриСозданииНаСервере()
